<a href="https://colab.research.google.com/github/koolganni/pandas-cheatsheet/blob/main/pandas-cheatsheet.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

**1. How to change values in a pandas DataFrame column based on a condition**

In [ ]:
df = pd.DataFrame(data={'Name': ['Bob', 'Paul'], 'Age': [22, 24]})

In [ ]:
df

   Name  Age
0   Bob   22
1  Paul   24

In [ ]:
# pandas.DataFrame.loc[condition, column_label] = new_value
df.loc[df.Name == 'Bob', 'Age'] = 26
df

   Name  Age
0   Bob   26
1  Paul   24

**2. How to get a value in a pandas DataFrame using an index**

In [ ]:
df = pd.DataFrame(data={'shot_made_flag': ['True', 'False', 'False', 'True', 'True', 'True', 'False', 'False', 'True']})

In [ ]:
df

  shot_made_flag
0           True
1          False
2          False
3           True
4           True
5           True
6          False
7          False
8           True

In [ ]:
df['shot_made_flag'].value_counts()

True     5
False    4
Name: shot_made_flag, dtype: int64

In [ ]:
# Counts of TRUE flag
df['shot_made_flag'].value_counts().at['True']

5

**3. Add or Change values in a pandas DataFrame column based on certain condition which is related to other columns**

In [ ]:
df = pd.DataFrame(data={'htm': ['LAL', 'NYK', 'CHH', 'CHH', 'LAL'], 'vtm': ['MIN', 'LAL', 'LAL', 'LAL', 'TOR']})

In [ ]:
df

   htm  vtm
0  LAL  MIN
1  NYK  LAL
2  CHH  LAL
3  CHH  LAL
4  LAL  TOR

In [ ]:
# if htm is 'LAL', opponent is vtm. Or if not, htm.
df['opponent'] = np.where(df['htm'] == 'LAL', df['vtm'], df['htm'])
df

   htm  vtm opponent
0  LAL  MIN      MIN
1  NYK  LAL      NYK
2  CHH  LAL      CHH
3  CHH  LAL      CHH
4  LAL  TOR      TOR

**4. Drop rows from a pandas DataFrame based on certain condition applied on a column**

In [2]:
df = pd.DataFrame(data={'product': ['white sneakers', 'blue jeans', 'silver bracelet', 'orange beanie', 'glasses'], 'price': [120, 200, 415, 80, 330]})

In [3]:
df

           product  price
0   white sneakers    120
1       blue jeans    200
2  silver bracelet    415
3    orange beanie     80
4          glasses    330

In [4]:
# Drop all rows for which the product's price is greater than $300
df.drop(df[(df['price'] > 300)].index, inplace=True) 
df

          product  price
0  white sneakers    120
1      blue jeans    200
3   orange beanie     80